app/controllers/todo_items_controller.rb

INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Test"], ["todo_list_id", 1], ["created_at", "2015-07-11 18:46:40.042725"], ["updated_at", "2015-07-11 18:46:40.042725"]]
---
	def create
		@todo_item = @todo_list.todo_items.create(todo_item_params)

DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 1]]
---
	def destroy
		if @todo_item.destroy

UPDATE "todo_items" SET "completed_at" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["completed_at", "2015-07-11 19:06:16.804750"], ["updated_at", "2015-07-11 19:06:16.805292"], ["id", 2]]
---
	def complete
		@todo_item.update_attribute(:completed_at, Time.now)

SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", 1]]
---
	def set_todo_list
		@todo_list = TodoList.find(params[:todo_list_id])

SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 1], ["id", 2]]
---
	def set_todo_item
		@todo_item = @todo_list.todo_items.find(params[:id])